Repository: freeabyss/assistant
Catalog: SnapVault/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# settings.general
source: General
zh_hans: 通用

# settings.shortcuts
source: Shortcuts
zh_hans: 快捷键

# settings.data
source: Data
zh_hans: 数据

# settings.about
source: About
zh_hans: 关于

# settings.retention.label
source: Keep history for:
zh_hans: 保留历史：

# settings.retention.format
source: %d days
zh_hans: %d 天

# settings.storage.label
source: Storage limit:
zh_hans: 存储上限：

# settings.retention.header
source: Retention
zh_hans: 保留策略

# settings.retention.footer
source: Clipboard items older than the retention period will be automatically deleted. Pinned items are never removed.
zh_hans: 超过保留期限的剪贴板内容将被自动删除。置顶内容不受影响。

# settings.launchAtLogin
source: Launch at login
zh_hans: 开机启动

# settings.ocrEnabled
source: OCR text recognition
zh_hans: OCR 文字识别

# settings.polling.label
source: Polling interval:
zh_hans: 轮询间隔：

# settings.polling.500ms
source: 500 ms
zh_hans: 500 毫秒

# settings.polling.1000ms
source: 1000 ms
zh_hans: 1000 毫秒

# settings.polling.2000ms
source: 2000 ms
zh_hans: 2000 毫秒

# settings.behavior.header
source: Behavior
zh_hans: 行为

# settings.behavior.footer
source: OCR extracts text from images for search. Polling interval controls how often Assistant checks the clipboard for new content.
zh_hans: OCR 从图片中提取文字用于搜索。轮询间隔控制 Assistant 检查剪贴板新内容的频率。

# settings.restoreDefaults
source: Restore Defaults
zh_hans: 恢复默认

# settings.restoreDefaults.help
source: Reset all general settings to their default values
zh_hans: 将所有通用设置恢复为默认值

# settings.save
source: Save
zh_hans: 保存

# settings.save.help
source: Save all settings changes
zh_hans: 保存所有设置更改

# settings.shortcuts.togglePanel
source: Toggle Panel:
zh_hans: 切换面板：

# settings.shortcuts.captureRegion
source: Capture Region:
zh_hans: 区域截图：

# settings.shortcuts.captureWindow
source: Capture Window:
zh_hans: 窗口截图：

# settings.shortcuts.header
source: Global Shortcuts
zh_hans: 全局快捷键

# settings.shortcuts.footer.defaults
source: Defaults: Open Search ⌥Space · Capture Region ⌘⇧A · Capture Window ⌘⇧W.
zh_hans: 默认：打开搜索 ⌥空格 · 区域截图 ⌘⇧A · 窗口截图 ⌘⇧W。

# settings.shortcuts.footer.spotlightWarning
source: If the default shortcut is unavailable on your Mac, record a different one here or during Onboarding.
zh_hans: 如果默认快捷键在你的 Mac 上不可用，请在此处或首次引导中重新录制一个可用快捷键。

# settings.shortcuts.footer.instructions
source: Click a recorder field and press your desired key combination. Capture Region lets you select an area to screenshot. Capture Window captures the window under your cursor.
zh_hans: 点击录制区域并按下你想要的组合键。区域截图可让你选择截图区域，窗口截图可捕捉光标下的窗口。

# settings.data.dbSize
source: Database size:
zh_hans: 数据库大小：

# settings.data.refresh
source: Refresh
zh_hans: 刷新

# settings.data.totalItems
source: Total items:
zh_hans: 总条目数：

# settings.data.storage.header
source: Storage
zh_hans: 存储

# settings.data.exportJson
source: Export JSON...
zh_hans: 导出 JSON...

# settings.data.exportCsv
source: Export CSV...
zh_hans: 导出 CSV...

# settings.data.exportDb
source: Export Database...
zh_hans: 导出数据库...

# settings.data.export.header
source: Export
zh_hans: 导出

# settings.data.export.footer
source: JSON includes all data (images as Base64). CSV includes text fields only. Database exports the raw SQLite file.
zh_hans: JSON 包含所有数据（图片以 Base64 编码）。CSV 仅包含文本字段。数据库导出原始 SQLite 文件。

# settings.data.importJson
source: Import JSON...
zh_hans: 导入 JSON...

# settings.data.importing
source: Importing...
zh_hans: 正在导入...

# settings.data.import.header
source: Import
zh_hans: 导入

# settings.data.import.footer
source: Import data from a previously exported JSON file. Duplicate items (same content hash) will be skipped.
zh_hans: 从之前导出的 JSON 文件导入数据。重复内容（相同哈希值）将被跳过。

# settings.data.status.dismiss
source: Dismiss
zh_hans: 关闭

# settings.data.clearHistory
source: Clear History...
zh_hans: 清除历史...

# settings.data.clearHistory.confirm.title
source: Are you sure you want to clear all clipboard history?
zh_hans: 确定要清除所有剪贴板历史吗？

# settings.data.clearHistory.confirm.message
source: This will permanently delete all non-pinned clipboard items. Pinned items will be preserved. This action cannot be undone.
zh_hans: 这将永久删除所有非置顶的剪贴板内容。置顶内容将被保留。此操作不可撤销。

# settings.data.clearHistory.confirm.action
source: Clear All History
zh_hans: 清除全部历史

# settings.data.clearHistory.cancel
source: Cancel
zh_hans: 取消

# settings.data.dangerZone.header
source: Danger Zone
zh_hans: 危险区域

# settings.alert.ok
source: OK
zh_hans: 确定

# settings.alert.cancel
source: Cancel
zh_hans: 取消

# settings.savePanel.json
source: Export Clipboard History as JSON
zh_hans: 导出剪贴板历史为 JSON

# settings.savePanel.csv
source: Export Clipboard History as CSV
zh_hans: 导出剪贴板历史为 CSV

# settings.savePanel.db
source: Export Database File
zh_hans: 导出数据库文件

# settings.openPanel.import
source: Import Clipboard History
zh_hans: 导入剪贴板历史

# settings.about.version
source: Version %@ (%@)
zh_hans: 版本 %@ (%@)

# settings.about.description
source: A fast, local clipboard manager for macOS.
zh_hans: 一款快速、本地的 macOS 剪贴板管理器。

# settings.about.checkUpdates
source: Check for Updates...
zh_hans: 检查更新...

# settings.about.techStack
source: Built with SwiftUI + GRDB
zh_hans: 使用 SwiftUI + GRDB 构建

# settings.about.dataNote
source: Data is stored locally on your Mac.
zh_hans: 数据仅存储在你的 Mac 本地。

# settings.saveError.title
source: Save Error
zh_hans: 保存错误

# settings.saveError.message
source: Failed to save settings: %@
zh_hans: 保存设置失败：%@

# settings.exportError.title
source: Export Error
zh_hans: 导出错误

# settings.exportError.message
source: Failed to export: %@
zh_hans: 导出失败：%@

# settings.export.json.success
source: Exported %d items to JSON
zh_hans: 已导出 %d 条记录为 JSON

# settings.export.csv.success
source: Exported %d items to CSV
zh_hans: 已导出 %d 条记录为 CSV

# settings.export.db.success
source: Database exported
zh_hans: 数据库已导出

# settings.importError.title
source: Import Error
zh_hans: 导入错误

# settings.importError.message
source: Failed to import JSON: %@
zh_hans: 导入 JSON 失败：%@

# settings.clearError.title
source: Clear Error
zh_hans: 清除错误

# settings.clearError.message
source: Failed to clear history: %@
zh_hans: 清除历史失败：%@

# settings.clear.success
source: Cleared %d items
zh_hans: 已清除 %d 条记录

# annotation.window.title
source: Annotate Screenshot
zh_hans: 标注截图

# annotation.tool.arrow
source: Arrow
zh_hans: 箭头

# annotation.tool.rectangle
source: Rectangle
zh_hans: 矩形

# annotation.tool.mosaic
source: Mosaic
zh_hans: 马赛克

# annotation.tool.text
source: Text
zh_hans: 文字

# annotation.undo.help
source: Undo (⌘Z)
zh_hans: 撤销 (⌘Z)

# annotation.redo.help
source: Redo (⌘⇧Z)
zh_hans: 重做 (⌘⇧Z)

# annotation.cancel
source: Cancel
zh_hans: 取消

# annotation.copy
source: Copy
zh_hans: 复制

# annotation.save
source: Save
zh_hans: 保存

# annotation.textInput.title
source: Enter Text
zh_hans: 输入文字

# annotation.textInput.message
source: Text will appear at the clicked position.
zh_hans: 文字将显示在点击位置。

# annotation.textInput.add
source: Add
zh_hans: 添加

# annotation.textInput.cancel
source: Cancel
zh_hans: 取消

# annotation.textInput.placeholder
source: Label text
zh_hans: 标注文字

# annotation.savePanel.title
source: Save Annotated Screenshot
zh_hans: 保存标注截图

# annotation.savePanel.filename
source: Screenshot %@.png
zh_hans: 截图 %@.png

# preview.empty
source: Empty content
zh_hans: 空内容

# preview.ocrText
source: OCR Text
zh_hans: OCR 文本

# preview.imageNotAvailable
source: Image data not available
zh_hans: 图片数据不可用

# preview.fileName
source: File Name
zh_hans: 文件名

# preview.filePath
source: Path
zh_hans: 路径

# preview.fileSize
source: Size
zh_hans: 大小

# preview.fileType
source: Type
zh_hans: 类型

# preview.fileModified
source: Modified
zh_hans: 修改时间

# preview.showInFinder
source: Show in Finder
zh_hans: 在 Finder 中显示

# preview.fileNotAvailable
source: File path not available
zh_hans: 文件路径不可用

# preview.delete
source: Delete
zh_hans: 删除

# preview.copy
source: Copy
zh_hans: 复制

# screenshot.toolbar.ocr
source: OCR
zh_hans: 识别

# screenshot.toolbar.copy
source: Copy
zh_hans: 复制

# screenshot.toolbar.save
source: Save
zh_hans: 保存

# screenshot.toolbar.annotate
source: Annotate
zh_hans: 标注

# screenshot.toolbar.discard
source: Cancel
zh_hans: 取消

# screenshot.savePanel.title
source: Save Screenshot
zh_hans: 保存截图

# screenshot.savePanel.filename
source: Screenshot %@.png
zh_hans: 截图 %@.png

# screenshot.ocr.progress
source: Recognizing text…
zh_hans: 正在识别文字…

# screenshot.ocr.noText
source: (no text recognized)
zh_hans: （未识别到文字）

# screenshot.ocr.failed
source: OCR failed: %@
zh_hans: OCR 失败：%@

# screenshot.ocr.lines
source: %d lines
zh_hans: %d 行

# screenshot.ocr.confidence
source: %.0f%% confidence
zh_hans: %.0f%% 置信度

# screenshot.ocr.close
source: Close
zh_hans: 关闭

# screenshot.ocr.copyAll
source: Copy All
zh_hans: 复制全部

# screenshot.ocr.copied
source: Copied
zh_hans: 已复制

# screenshot.ocr.window.title
source: OCR Result
zh_hans: OCR 结果

# system.sleep.title
source: Sleep
zh_hans: 睡眠

# system.sleep.subtitle
source: Put the Mac to sleep
zh_hans: 让 Mac 进入睡眠

# system.restart.title
source: Restart
zh_hans: 重启

# system.restart.subtitle
source: Restart the Mac (confirmation required)
zh_hans: 重新启动 Mac（需要确认）

# system.shutdown.title
source: Shut Down
zh_hans: 关机

# system.shutdown.subtitle
source: Shut down the Mac (confirmation required)
zh_hans: 关闭 Mac（需要确认）

# system.lock.title
source: Lock Screen
zh_hans: 锁定屏幕

# system.lock.subtitle
source: Lock the screen immediately
zh_hans: 立即锁定屏幕

# system.lockScreen.title
source: Lock Screen (Display Sleep)
zh_hans: 锁屏（关闭显示器）

# system.lockScreen.subtitle
source: Turn off the display
zh_hans: 关闭显示器

# system.emptyTrash.title
source: Empty Trash
zh_hans: 清倒废纸篓

# system.emptyTrash.subtitle
source: Permanently delete all items in Trash (confirmation required)
zh_hans: 永久删除废纸篓中的所有项目（需要确认）

# system.showDesktop.title
source: Show Desktop
zh_hans: 显示桌面

# system.showDesktop.subtitle
source: Hide all windows and show the desktop
zh_hans: 隐藏所有窗口并显示桌面

# system.confirm.restart.title
source: Restart your Mac?
zh_hans: 重新启动 Mac？

# system.confirm.restart.message
source: All open applications will be closed and the computer will restart.
zh_hans: 所有打开的应用程序将被关闭，电脑将重新启动。

# system.confirm.shutdown.title
source: Shut down your Mac?
zh_hans: 关闭 Mac？

# system.confirm.shutdown.message
source: All open applications will be closed and the computer will turn off.
zh_hans: 所有打开的应用程序将被关闭，电脑将关机。

# system.confirm.emptyTrash.title
source: Empty the Trash?
zh_hans: 清倒废纸篓？

# system.confirm.emptyTrash.message
source: Items in the Trash will be permanently deleted.
zh_hans: 废纸篓中的项目将被永久删除。

# system.confirm.fallback
source: Run %@?
zh_hans: 执行 %@？

# search.type.applications
source: Applications
zh_hans: 应用程序

# search.type.files
source: Files
zh_hans: 文件

# search.type.clipboard
source: Clipboard
zh_hans: 剪贴板

# search.type.system
source: System
zh_hans: 系统

# search.type.calculator
source: Calculator
zh_hans: 计算器

# search.type.convert
source: Convert
zh_hans: 换算

# search.noResults
source: No %@ results
zh_hans: 没有 %@ 结果

# search.action.launchApp
source: Enter
zh_hans: 回车

# search.action.openFile
source: Enter
zh_hans: 回车

# search.action.openInFinder
source: Enter
zh_hans: 回车

# search.action.copyClipboard
source: Enter
zh_hans: 回车

# search.action.runCommand
source: Enter
zh_hans: 回车

# search.action.copyText
source: Copy
zh_hans: 复制

# search.searching
source: Searching...
zh_hans: 正在搜索...

# search.noResults.all
source: No results found
zh_hans: 未找到结果

# error.database
source: Database error: %@
zh_hans: 数据库错误：%@

# error.ocrFailed
source: OCR failed: %@
zh_hans: OCR 失败：%@

# error.clipboardDenied
source: Clipboard access denied
zh_hans: 剪贴板访问被拒绝

# error.itemNotFound
source: Item with id %lld not found
zh_hans: ID 为 %lld 的记录未找到

# error.storageExceeded
source: Storage limit exceeded
zh_hans: 存储空间已满

# error.exportFailed
source: Export failed: %@
zh_hans: 导出失败：%@

# error.importFailed
source: Import failed: %@
zh_hans: 导入失败：%@

# error.screenshotFailed
source: Screenshot failed: %@
zh_hans: 截图失败：%@

# error.invalidImageData
source: Unable to decode image data
zh_hans: 无法解码图片数据

# error.serviceDeallocated
source: Service deallocated
zh_hans: 服务已释放

# error.userCancelled
source: User cancelled
zh_hans: 用户取消

# error.noWindows
source: No on-screen windows available
zh_hans: 没有可用的屏幕窗口

# error.noMainScreen
source: No main screen available
zh_hans: 没有可用的主屏幕

# error.noWindowAtMouse
source: No window found at mouse location
zh_hans: 在鼠标位置未找到窗口

# error.captureWindowFailed
source: Failed to capture window image
zh_hans: 无法捕捉窗口图像

# error.pngConversionFailed
source: Failed to convert captured image to PNG
zh_hans: 无法将截图转换为 PNG

# error.captureScreenFailed
source: Failed to capture screen image
zh_hans: 无法捕捉屏幕图像

# error.cropFailed
source: Failed to crop image to selected region
zh_hans: 无法裁剪到选定区域

# error.itemNoImageData
source: Item has no image data
zh_hans: 记录没有图片数据

# error.itemNotFoundId
source: Item id=%lld not found
zh_hans: ID=%lld 的记录未找到

# error.itemNoImageDataId
source: Item id=%lld has no image data
zh_hans: ID=%lld 的记录没有图片数据

# error.ocrServiceDeallocated
source: OCRService deallocated
zh_hans: OCR 服务已释放

# error.export.invalidFormat
source: Invalid format: %@
zh_hans: 无效格式：%@

# error.export.fileNotFound
source: File not found: %@
zh_hans: 文件未找到：%@

# error.export.csvUtf8
source: Failed to encode CSV as UTF-8
zh_hans: 无法将 CSV 编码为 UTF-8

# error.export.jsonFormat
source: Invalid JSON format: %@
zh_hans: 无效的 JSON 格式：%@

# error.export.noItems
source: No items found in export file
zh_hans: 导出文件中没有找到记录

# error.export.result.format
source: Imported %d items, skipped %d duplicates (%d total)
zh_hans: 已导入 %d 条，跳过 %d 条重复（共 %d 条）

# unit.currency.note
source: Rates are static reference values
zh_hans: 汇率为静态参考值

# unit.currency.usd
source: US Dollar USD
zh_hans: 美元 USD

# unit.currency.cny
source: Chinese Yuan CNY
zh_hans: 人民币 CNY

# unit.currency.eur
source: Euro EUR
zh_hans: 欧元 EUR

# unit.currency.jpy
source: Japanese Yen JPY
zh_hans: 日元 JPY

# unit.currency.gbp
source: British Pound GBP
zh_hans: 英镑 GBP

# unit.currency.hkd
source: Hong Kong Dollar HKD
zh_hans: 港币 HKD

# unit.currency.result.subtitle
source: %@ → %@ · Rates are static reference values
zh_hans: %@ → %@ · 汇率为静态参考值

# clipboard.untitled
source: Untitled
zh_hans: 无标题

# clipboard.richText
source: Rich Text
zh_hans: 富文本

# clipboard.image
source: Image
zh_hans: 图片

# clipboard.ocrAvailable
source: OCR text available
zh_hans: OCR 文本可用

# clipboard.file
source: File
zh_hans: 文件

# time.justNow
source: Just now
zh_hans: 刚刚

# time.minutesAgo
source: %dm ago
zh_hans: %d分钟前

# time.hoursAgo
source: %dh ago
zh_hans: %d小时前

# time.daysAgo
source: %dd ago
zh_hans: %d天前

# menubar.search
source: Search
zh_hans: 搜索

# menubar.recent
source: Recent
zh_hans: 最近

# menubar.searchPlaceholder
source: Search...
zh_hans: 搜索…

# menubar.resultsCount
source: %d results
zh_hans: %d 个结果

# menubar.tab.all
source: All
zh_hans: 全部

# menubar.tab.calculator
source: Calculator
zh_hans: 计算器

# menubar.tab.convert
source: Convert
zh_hans: 换算

# menubar.tab.apps
source: Apps
zh_hans: 应用

# menubar.tab.system
source: System
zh_hans: 系统

# menubar.tab.files
source: Files
zh_hans: 文件

# menubar.tab.clipboard
source: Clipboard
zh_hans: 剪贴板

# recent.empty.title
source: No records
zh_hans: 暂无记录

# recent.empty.subtitle
source: Copied content or screenshots will appear here
zh_hans: 复制内容或截图后将出现在这里

# recent.filter.all
source: All
zh_hans: 全部

# recent.filter.screenshot
source: Screenshot
zh_hans: 截图

# recent.filter.clipboard
source: Clipboard
zh_hans: 剪贴板

# clipboard.loading
source: Loading...
zh_hans: 加载中…

# clipboard.empty.title
source: No clipboard history
zh_hans: 暂无剪贴板记录

# clipboard.empty.subtitle
source: Items you copy will appear here
zh_hans: 复制的内容将出现在这里

# clipboard.favorite
source: Favorite
zh_hans: 收藏

# clipboard.unfavorite
source: Unfavorite
zh_hans: 取消收藏

# clipboard.pin
source: Pin
zh_hans: 置顶

# clipboard.unpin
source: Unpin
zh_hans: 取消置顶

# content.text
source: Text
zh_hans: 文本

# content.richText
source: Rich Text
zh_hans: 富文本

# content.image
source: Image
zh_hans: 图片

# content.file
source: File
zh_hans: 文件

# date.today
source: Today
zh_hans: 今天

# date.yesterday
source: Yesterday
zh_hans: 昨天

# date.olderFormat
source: MMM d
zh_hans: M月d日

# toast.copied
source: Copied
zh_hans: 已复制

# settings.language
source: Language
zh_hans: 语言

# settings.language.header
source: Language
zh_hans: 语言

# settings.language.footer
source: Language change takes effect after restarting the app
zh_hans: 语言变更将在重启应用后生效

# preview.open
source: Preview
zh_hans: 预览

# screenshot.windowOverlay.hint
source: Click to capture · ESC to cancel
zh_hans: 点击捕获 · ESC 取消

# searchPanel.placeholder
source: Search apps, commands, clipboard, calculations, settings...
zh_hans: 搜索应用、命令、剪贴板、计算、设置…

# searchPanel.emptyHint
source: Type to search. Empty input does not show recommendations or recent content.
zh_hans: 输入关键词开始搜索。空输入不显示推荐或最近内容。

# searchPanel.noResults
source: No results
zh_hans: 没有结果

# searchPanel.type.application
source: Application
zh_hans: 应用

# searchPanel.type.command
source: Command
zh_hans: 命令

# searchPanel.type.calculator
source: Calculator
zh_hans: 计算

# searchPanel.type.convert
source: Convert
zh_hans: 换算

# searchPanel.type.settings
source: Settings
zh_hans: 设置

# searchPanel.type.clipboard
source: Clipboard
zh_hans: 剪贴板

# searchPanel.confirm.destructive
source: This action requires confirmation and may not be undoable.
zh_hans: 此操作需要确认，且可能无法撤销。

# searchPanel.error.recordNotFound
source: Clipboard record not found.
zh_hans: 未找到剪贴板记录。

# content.rtf
source: Rich Text
zh_hans: 富文本

# clipboard.history.title
source: Clipboard History
zh_hans: 剪贴板历史

# clipboard.history.subtitle
source: Search and manage local text, rich text, images, and files.
zh_hans: 搜索和管理本地文本、富文本、图片和文件历史。

# clipboard.search.placeholder
source: Search clipboard history…
zh_hans: 搜索剪贴板历史…

# clipboard.filter.all
source: All
zh_hans: 全部

# clipboard.filter.text
source: Text
zh_hans: 文本

# clipboard.filter.image
source: Images
zh_hans: 图片

# clipboard.filter.file
source: Files
zh_hans: 文件

# clipboard.storage.label
source: Storage Used
zh_hans: 存储占用

# clipboard.clearAll.button
source: Clear All
zh_hans: 清空全部

# clipboard.clearAll.title
source: Clear Clipboard History?
zh_hans: 清空剪贴板历史？

# clipboard.clearAll.message
source: This action cannot be undone. All clipboard history items and related local resources will be deleted.
zh_hans: 此操作不可撤销。所有剪贴板历史项及相关本地资源都将被删除。

# clipboard.clearAll.action
source: Clear All History
zh_hans: 清空全部历史

# clipboard.clearAll.success
source: Clipboard history cleared
zh_hans: 剪贴板历史已清空

# clipboard.items.count
source: %lld items
zh_hans: %lld 项

# clipboard.empty.search.title
source: No matching clipboard items
zh_hans: 没有匹配的剪贴板项目

# clipboard.empty.search.subtitle
source: Try another keyword or switch the type filter.
zh_hans: 请尝试其他关键词或切换类型筛选。

# clipboard.resourceMissing
source: Resource missing
zh_hans: 资源已丢失

# clipboard.action.copy
source: Copy to Clipboard
zh_hans: 复制到剪贴板

# clipboard.image.subtitle
source: Image clipboard item
zh_hans: 图片剪贴板项目

# onboarding.welcome.title
source: Welcome to Mac Super Assistant
zh_hans: 欢迎使用 Mac Super Assistant

# onboarding.welcome.subtitle
source: Your Spotlight-style command bar for search, clipboard, screenshots, commands, and settings.
zh_hans: 一个 Spotlight 风格的效率入口，聚合搜索、剪贴板、截图、命令和设置。

# onboarding.welcome.point.search
source: Open a centered search panel and run actions from the keyboard.
zh_hans: 通过居中搜索面板，用键盘快速执行常用动作。

# onboarding.welcome.point.clipboard
source: Clipboard history is local-first and helps you find copied content again.
zh_hans: 剪贴板历史以本地优先方式保存，方便找回复制过的内容。

# onboarding.welcome.point.screenshot
source: Screenshot permissions are required before capture tools can work reliably.
zh_hans: 截图工具需要先完成必要权限授权才能稳定使用。

# onboarding.searchHotkey.title
source: Search shortcut
zh_hans: 搜索入口与快捷键

# onboarding.searchHotkey.subtitle
source: Use ⌥ Space by default, or record another shortcut if it conflicts.
zh_hans: 默认使用 ⌥ 空格；如发生冲突，请重新录制其他快捷键。

# onboarding.hotkey.description
source: Assistant will register a global shortcut for opening and closing the search panel.
zh_hans: Assistant 会注册一个全局快捷键，用于打开和关闭搜索面板。

# onboarding.hotkey.valid
source: Shortcut is available.
zh_hans: 快捷键可用。

# onboarding.hotkey.conflict
source: This shortcut conflicts with an enabled macOS shortcut. Record another one to continue.
zh_hans: 该快捷键与已启用的 macOS 快捷键冲突。请重新录制后继续。

# onboarding.hotkey.invalid
source: Record a shortcut before continuing.
zh_hans: 请先录制一个快捷键。

# onboarding.hotkey.recheck
source: Recheck shortcut
zh_hans: 重新检测快捷键

# onboarding.clipboardPrivacy.title
source: Clipboard history
zh_hans: 剪贴板历史

# onboarding.clipboardPrivacy.subtitle
source: Clipboard recording is on by default, with explicit local privacy boundaries.
zh_hans: 剪贴板记录默认开启，并明确说明本地隐私边界。

# onboarding.clipboard.point.defaultOn
source: Clipboard history is enabled by default for text, images, and file references.
zh_hans: 剪贴板历史默认开启，支持文本、图片和文件引用。

# onboarding.clipboard.point.localOnly
source: Clipboard data stays on this Mac and is not uploaded, synced, or used for training.
zh_hans: 剪贴板数据仅保存在本机，不上传、不同步、不用于训练。

# onboarding.clipboard.point.control
source: You can pause recording or clear history later from settings or clipboard history.
zh_hans: 之后可在设置或剪贴板历史中暂停记录或清空历史。

# onboarding.clipboard.acknowledge
source: I understand clipboard history is enabled by default and stored locally.
zh_hans: 我已知晓剪贴板历史默认开启，且数据仅本地保存。

# onboarding.screenRecording.title
source: Screen Recording permission
zh_hans: 屏幕录制权限

# onboarding.screenRecording.subtitle
source: Required for region, full-screen, and window screenshots.
zh_hans: 区域、全屏和窗口截图都需要此权限。

# onboarding.screenRecording.description
source: macOS requires Screen Recording permission before Assistant can capture screenshots. Without it, screenshot features cannot work.
zh_hans: macOS 要求授予屏幕录制权限后，Assistant 才能进行截图。未授权时截图功能无法使用。

# onboarding.accessibility.title
source: Accessibility permission
zh_hans: 辅助功能权限

# onboarding.accessibility.subtitle
source: Required to support safe system-control workflows.
zh_hans: 用于支持安全的系统控制类工作流。

# onboarding.accessibility.description
source: Assistant needs Accessibility permission for controlled macOS automation paths such as future auto-paste, window control, simulated shortcuts, and controlling other apps.
zh_hans: Assistant 需要辅助功能权限，用于受控的 macOS 自动化路径，例如后续自动粘贴、窗口控制、模拟快捷键和控制其他 App。

# onboarding.accessibility.boundary
source: MVP uses this permission only within documented Assistant features. It does not run arbitrary shell commands or upload your data.
zh_hans: MVP 仅在已说明的 Assistant 功能边界内使用此权限，不执行任意 shell，也不会上传你的数据。

# onboarding.permission.authorized
source: Permission granted.
zh_hans: 权限已授予。

# onboarding.permission.notAuthorized
source: Permission not granted yet.
zh_hans: 尚未授予权限。

# onboarding.permission.openSettings
source: Open System Settings
zh_hans: 打开系统设置

# onboarding.permission.recheck
source: Recheck
zh_hans: 重新检测

# onboarding.permission.required
source: This permission is required. If it is denied, you cannot finish Onboarding.
zh_hans: 这是必要权限。拒绝授权时无法完成首次引导。

# onboarding.launchAtLogin.title
source: Launch at login
zh_hans: 开机启动

# onboarding.launchAtLogin.subtitle
source: Keep Assistant available from the menu bar after login.
zh_hans: 登录后让 Assistant 常驻菜单栏，随时可用。

# onboarding.launchAtLogin.description
source: Assistant is designed as a menu bar utility. Launch at login is enabled by default after Onboarding and can be turned off later in Settings.
zh_hans: Assistant 是菜单栏效率工具。完成首次引导后默认启用开机启动，你也可以之后在设置中关闭。

# onboarding.launchAtLogin.toggle
source: Enable launch at login
zh_hans: 启用开机启动

# onboarding.done.title
source: Ready to go
zh_hans: 准备就绪

# onboarding.done.subtitle
source: Finish setup and enter Assistant.
zh_hans: 完成设置并进入 Assistant。
